[
    {
        "title": "Texas Man",
        "year": "2025",
        "description": "Current chapter: A man with a heart as big as his home state. An officer and a gentleman—though I'm strategically overlooking his marine-sized red flag. He looks devastatingly good in uniform and even better out of it. This one? Definitely different. ❤️"
    },
    {
        "title": "The Bare Minimum",
        "year": "2023",
        "description": "Two years of accepting crumbs while he convinced me it was a feast. Thought showing up was the same as showing effort. Set the bar so low it became a limbo stick."
    },
    {
        "title": "The Navy Seal",
        "year": "2022",
        "description": "Adult Peter Pan who never wanted to grow up. His only life goal is committing war crimes. I slept on my side while he slept with everyone."
    },
    {
        "title": "The Fighter Jet Pilot",
        "year": "2022",
        "description": "Had nothing going for himself besides his dad being a NASA astronaut. Reached for the stars by riding daddy's coattails. Houston, we have daddy issues."
    },
    {
        "title": "The Nice Guy™",
        "year": "2022",
        "description": "Actually lived up to the nice guy title. Probably my Noah, but I wasn't ready for my Notebook moment yet. Thanks for showing me what real love looks like, Clay. ❤️"
    },
    {
        "title": "The Narcissist",
        "year": "2021",
        "description": "Went to the Olympic trials for swimming, didn't make it, and got the rings tattooed on himself anyways. Spent more time looking in mirrors and at other girls than at me."
    },
    {
        "title": "The Stanford Football Player",
        "year": "2021",
        "description": "Full ride scholarship but still couldn't figure out how to pick me up for a date with a car. Turns out having a high IQ doesn't mean you know how to text back. Go Cardinal, I guess."
    },
    {
        "title": "The Hot Mess",
        "year": "2019",
        "description": "Face of an angel, personality of a prison warden. Looked great in photos but better in the rearview mirror. Taught me that six-pack abs aren't worth two years of therapy."
    },
    {
        "title": "The Gym Rat",
        "year": "2019",
        "description": "More committed to his protein shakes than our relationship. At least I learned proper squat form."
    },
    {
        "title": "Champagne Taste on a Beer Budget",
        "year": "2018",
        "description": "Great personality, empty wallet. Tried to give me the world but couldn't even afford the globe emoji. My mom's favorite ex despite never picking up a check. Guess charm is free."
    },
    {
        "title": "The Momma's Boy",
        "year": "2018",
        "description": "Still cuddled with mommy as a grown man. Every nice thing I did got compared to her - sorry I don't cut your sandwiches into hearts like she does. Bet she doesn't kiss you like I do though... or maybe she does."
    },
    {
        "title": "The Predator",
        "year": "2015",
        "description": "Twenty-one and hanging out at high schools. Lost him to a Hooters waitress (she was actually age-appropriate). Turns out wings weren't the only thing he got his hands on."
    }
]